<a href="https://colab.research.google.com/github/ssumannb/BigData_Analyst_exam/blob/main/BankMarketing_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

Q1. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는?  
A1. 30

In [ ]:
df['age_category'] = [str(x)[0]+'0' for _, x in enumerate(df['age'])]
# results = (df.age//10 *10)
df['age_category'].unique()
df['age_category'].value_counts().index[0]

'30'

value_counts()는 어떤 컬럼/Series의 unique value들을 count해주는 함수입니다 (documentation). 결과는 인덱스가 unique value들이고, 값은 count가 들어가 있는 Series입니다.

Q2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

A2. 5056

In [ ]:
df['age_category'].value_counts()[0]

5056

Q3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

A3. 504

In [ ]:
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y,age_category
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no,20
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no,20
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no,30
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no,40
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no,20

In [ ]:
housing_yes = df[df['housing']=='yes']
housing_yes = housing_yes[housing_yes['age']>=25]
housing_yes = housing_yes[housing_yes['age']<29]
# result = df[(df.age >=25) & (df.age<29) & (df.housing =='yes')].shape[0]
len(housing_yes)

504

Q4.  numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?  
A4. job  


value_counts()
- series, dataframe 모두 사용 가능
- unique 값의 개수를 집계해주는 함수  

unique()
- series, dataframe 모두 사용 가능
- unique 값 리스트를 추출해주는 함수

In [ ]:
cnt = 0
col_name = ''

for col in df:
  if df[col].dtypes == 'object':
    unique_val_list = df[col].unique() #value count 써도 됨
    if cnt < len(unique_val_list):
      cnt = len(unique_val_list)
      col_name = col

print(col_name)

job

Q5. balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

A5. 3473.73

In [ ]:
mean = df['balance'].mean()
df_mean = df[df['balance'] >= mean].sort_values(by='ID', ascending = False)
df_top100 = df_mean['balance'].iloc[:100]
print(df_top100.mean())

3473.73

Q6. 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

A6. (15, 'may')

In [ ]:
## '광고수' 컬럼이 뭐야?
campaign = df['campaign'].idxmax()
print(df.loc[campaign, ['day','month']])

day        9
month    jul
Name: 2556, dtype: object

Q7. 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

A7. 0.19611319

In [ ]:
## 데이터 정규성 검정: 분석하고자 하는 데이터가 정규분포를 따르는지를 검정하는 것을 말한다.
## 분석하고자 하는 데이터가 정규성을 가지는지 사전에 확인해야 분석 결과를 신뢰할 수 있기 때무닝다.
## 일반적으로 많이 사용하는 정규성 검정 방법
## 1. QQ Plot
## 2. Kolmogorov-Smirnov Test, Shapiro-Wilk Test
## 3. Anderson-Darling Test

In [ ]:
import scipy.stats as stats
import numpy as np

tmp = df[df['job']=='unknown']
age_np = np.array(tmp['age'])
test_stat, p_val = stats.shapiro(age_np)
print(p_val)

0.9784717559814453
0.1961131989955902

Q8.  age와 balance의 **상관계수**를 구하여라

A8. 0.1019

In [ ]:
## 상관계수 산정 방식에는
## 1. 피어슨 상관계수
## 2. 켄달-타우 상관계수
## 3. 스피어만 상관계수

In [ ]:
print(df[['age', 'balance']].corr(method='pearson').iloc[0,1])

0.10198734763981462

Q9. y 변수와 education 변수는 독립인지 **카이제곱검정**을 통해 확인하려한다. p-value값을 출력하라

A9. 7.901201277473551e-29

In [ ]:
from scipy.stats import chi2_contingency

tmp = pd.crosstab(df['education'], df['y'])
result = chi2_contingency(tmp)[1]
print(result)

7.901201277473551e-29

Q10. 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

A10. 0.283

In [22]:
import math

top = 0
job_list = df['job'].unique()
for _, job in enumerate(job_list):
  cnt_total = df[df['job']==job]['marital'].value_counts()
  # print(cnt_total)
  try:
    cnt_divorced = cnt_total['divorced']
  except:
    cnt_divorced = 0

  try:
    cnt_married = cnt_total['married']
  except:
    cnt_married = 0 + math.eps

  rate = cnt_divorced/cnt_married
  # print(f"**{job} : {round(rate, 3)}")
  # print(f"\t divorced({cnt_divorced}) / married({cnt_married})")
  if rate > top:
    top = rate

print(top)

0.2831050228310502